## dev: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 15 to add, 14 to change, 15 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                NAME                                                 |
|----------|-----------------------------------------------------------------------------------------------------|
| delete   | `aws_route53_record.notification-canada-ca-alt[&quot;*.alpha.dev.notification.cdssandbox.xyz&quot;]`          |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.alpha.dev.notification.cdssandbox.xyz&quot;]`      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.alpha.dev.notification.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;alpha.dev.notification.cdssandbox.xyz&quot;]`            |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.alpha.dev.notification.cdssandbox.xyz&quot;]`        |
| update   | `aws_acmpca_certificate_authority.client_vpn`                                                       |
|          | `aws_alb.notification-canada-ca`                                                                    |
|          | `aws_iam_policy.parameters_csi`                                                                     |
|          | `aws_iam_policy.secrets_csi`                                                                        |
|          | `aws_kinesis_firehose_delivery_stream.firehose-waf-logs`                                            |
|          | `aws_lb.internal_alb`                                                                               |
|          | `aws_lb_listener_rule.alt-domain-document-api-host-route[0]`                                        |
|          | `aws_lb_listener_rule.alt-domain-document-host-route[0]`                                            |
|          | `aws_lb_listener_rule.alt-domain-host-route[0]`                                                     |
|          | `aws_wafv2_web_acl.notification-canada-ca`                                                          |
|          | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`                                          |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]` |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2]` |
| recreate | `aws_acm_certificate.notification-canada-ca-alt[0]`                                                 |
|          | `aws_acm_certificate_validation.notification-canada-ca-alt[0]`                                      |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`                                      |
|          | `aws_lb_listener_certificate.alt_domain_certificate`                                                |
|          | `aws_route53_record.notification-alt-root[0]`                                                       |
|          | `aws_route53_record.notification-alt-root-WC[0]`                                                    |
|          | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`                                            |
|          | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.0.0/24&quot;]`                      |
|          | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.1.0/24&quot;]`                      |
|          | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.2.0/24&quot;]`                      |
| add      | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.dev.alpha.notification.cdssandbox.xyz&quot;]`      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.dev.alpha.notification.cdssandbox.xyz&quot;]`          |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.dev.alpha.notification.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.dev.alpha.notification.cdssandbox.xyz&quot;]`        |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;dev.alpha.notification.cdssandbox.xyz&quot;]`            |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/10928801109).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.notification-canada-ca-alt[0] must be replaced
+/- resource "aws_acm_certificate" "notification-canada-ca-alt" {
      ~ arn                       = "arn:aws:acm:ca-central-1:800095993820:certificate/91e895c8-f1f4-47a1-9bf2-03b8be5d1bdd" -> (known after apply)
      ~ domain_name               = "alpha.dev.notification.cdssandbox.xyz" -> "dev.alpha.notification.cdssandbox.xyz" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.alpha.dev.notification.cdssandbox.xyz"
              - resource_record_name  = "_f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_65a73dc17984586dde41232898b47f3a.lqynnrqbbf.acm-validations.aws."
            },
          - {
              - domain_name           = "*.api.alpha.dev.notification.cdssandbox.xyz"
              - resource_record_name  = "_a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_afa21a0930387d68d48a907e30f24086.lqynnrqbbf.acm-validations.aws."
            },
          - {
              - domain_name           = "*.document.alpha.dev.notification.cdssandbox.xyz"
              - resource_record_name  = "_d99e64ef0d022bd4beab79bebaa902b3.document.alpha.dev.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_b5357770b7f067b622daa8b2a786caec.lqynnrqbbf.acm-validations.aws."
            },
          - {
              - domain_name           = "alpha.dev.notification.cdssandbox.xyz"
              - resource_record_name  = "_f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_65a73dc17984586dde41232898b47f3a.lqynnrqbbf.acm-validations.aws."
            },
          - {
              - domain_name           = "api.alpha.dev.notification.cdssandbox.xyz"
              - resource_record_name  = "_a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_afa21a0930387d68d48a907e30f24086.lqynnrqbbf.acm-validations.aws."
            },
          + {
              + domain_name           = "*.api.dev.alpha.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "*.dev.alpha.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "*.document.dev.alpha.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "api.dev.alpha.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "dev.alpha.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:800095993820:certificate/91e895c8-f1f4-47a1-9bf2-03b8be5d1bdd" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2025-09-27T23:59:59Z" -> (known after apply)
      ~ not_before                = "2024-08-29T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "*.alpha.dev.notification.cdssandbox.xyz",
          - "*.api.alpha.dev.notification.cdssandbox.xyz",
          - "*.document.alpha.dev.notification.cdssandbox.xyz",
          - "alpha.dev.notification.cdssandbox.xyz",
          - "api.alpha.dev.notification.cdssandbox.xyz",
          + "*.api.dev.alpha.notification.cdssandbox.xyz",
          + "*.dev.alpha.notification.cdssandbox.xyz",
          + "*.document.dev.alpha.notification.cdssandbox.xyz",
          + "api.dev.alpha.notification.cdssandbox.xyz",
          + "dev.alpha.notification.cdssandbox.xyz",
        ]
        tags                      = {
            "CostCenter" = "notification-canada-ca-dev"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ options {
          + arn                       = (known after apply)
          + certificate_authority_arn = (known after apply)
          + certificate_body          = (known after apply)
          + certificate_chain         = (known after apply)
          + domain_name               = (known after apply)
          + domain_validation_options = (known after apply)
          + early_renewal_duration    = (known after apply)
          + id                        = (known after apply)
          + key_algorithm             = (known after apply)
          + not_after                 = (known after apply)
          + not_before                = (known after apply)
          + pending_renewal           = (known after apply)
          + private_key               = (known after apply)
          + renewal_eligibility       = (known after apply)
          + renewal_summary           = (known after apply)
          + status                    = (known after apply)
          + subject_alternative_names = (known after apply)
          + tags                      = (known after apply)
          + tags_all                  = (known after apply)
          + type                      = (known after apply)
          + validation_emails         = (known after apply)
          + validation_method         = (known after apply)
        } -> (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:800095993820:certificate/91e895c8-f1f4-47a1-9bf2-03b8be5d1bdd" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "2024-08-29 13:02:57.072 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz",
          - "_d99e64ef0d022bd4beab79bebaa902b3.document.alpha.dev.notification.cdssandbox.xyz",
          - "_f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
    }

  # aws_acmpca_certificate_authority.client_vpn will be updated in-place
  ~ resource "aws_acmpca_certificate_authority" "client_vpn" {
        id                              = "arn:aws:acm-pca:ca-central-1:800095993820:certificate-authority/f0d417c3-6bf1-470c-ad08-302f633a1667"
      ~ permanent_deletion_time_in_days = 30 -> 7
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb.notification-canada-ca will be updated in-place
  ~ resource "aws_alb" "notification-canada-ca" {
      ~ enable_deletion_protection                                   = false -> true
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:800095993820:loadbalancer/app/notification-dev-alb/77ce8d11a87750e4"
        name                                                         = "notification-dev-alb"
        tags                                                         = {
            "CostCenter" = "notification-canada-ca-dev"
            "Name"       = "notification-canada-ca"
        }
        # (25 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s must be replaced
-/+ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ca-central-1:800095993820:nodegroup/notification-canada-ca-dev-eks-cluster/notification-canada-ca-dev-eks-primary-node-group-k8s/08c8dea1-deac-052d-cd94-7e09bd9ffb8e" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "notification-canada-ca-dev-eks-cluster:notification-canada-ca-dev-eks-primary-node-group-k8s" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          ~ "m5.large" -> "r5.large",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.30.2-20240828" -> "1.30.2-20240904"
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-notification-canada-ca-dev-eks-primary-node-group-k8s-08c8dea1-deac-052d-cd94-7e09bd9ffb8e"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "CostCenter"             = "notification-canada-ca-dev"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-dev-eks-cluster"
        }
      ~ version                = "1.30" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-046c7279d9ecbf9e1"
          ~ name    = "notification-canada-ca-dev-eks-node-group" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ scaling_config {
          ~ desired_size = 4 -> 5
          ~ min_size     = 1 -> 4
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_policy.parameters_csi will be updated in-place
  ~ resource "aws_iam_policy" "parameters_csi" {
        id               = "arn:aws:iam::800095993820:policy/parameters-csi-policy"
        name             = "parameters-csi-policy"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.secrets_csi will be updated in-place
  ~ resource "aws_iam_policy" "secrets_csi" {
        id               = "arn:aws:iam::800095993820:policy/secrets-csi-policy"
        name             = "secrets-csi-policy"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:800095993820:deliverystream/aws-waf-logs-notification-canada-ca-waf"
        name           = "aws-waf-logs-notification-canada-ca-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          + custom_time_zone    = "UTC"
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ prefix              = (sensitive value)
            # (9 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb.internal_alb will be updated in-place
  ~ resource "aws_lb" "internal_alb" {
      ~ enable_deletion_protection                                   = false -> true
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:800095993820:loadbalancer/app/notify-dev-internal-alb/d319e2e4ebb7c406"
        name                                                         = "notify-dev-internal-alb"
        tags                                                         = {
            "CostCenter" = "notification-canada-ca-dev"
            "Name"       = "notification-canada-ca"
        }
        # (25 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lb_listener_certificate.alt_domain_certificate must be replaced
-/+ resource "aws_lb_listener_certificate" "alt_domain_certificate" {
      ~ certificate_arn = "arn:aws:acm:ca-central-1:800095993820:certificate/91e895c8-f1f4-47a1-9bf2-03b8be5d1bdd" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "arn:aws:elasticloadbalancing:ca-central-1:800095993820:listener/app/notification-dev-alb/77ce8d11a87750e4/4d7568f988d81a6f_arn:aws:acm:ca-central-1:800095993820:certificate/91e895c8-f1f4-47a1-9bf2-03b8be5d1bdd" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lb_listener_rule.alt-domain-document-api-host-route[0] will be updated in-place
  ~ resource "aws_lb_listener_rule" "alt-domain-document-api-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:800095993820:listener-rule/app/notification-dev-alb/77ce8d11a87750e4/4d7568f988d81a6f/8ceecb4734aab72b"
        tags         = {}
        # (4 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "api.document.alpha.dev.notification.cdssandbox.xyz",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "api.document.dev.alpha.notification.cdssandbox.xyz",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener_rule.alt-domain-document-host-route[0] will be updated in-place
  ~ resource "aws_lb_listener_rule" "alt-domain-document-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:800095993820:listener-rule/app/notification-dev-alb/77ce8d11a87750e4/4d7568f988d81a6f/aceb2e196a9cab01"
        tags         = {}
        # (4 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "document.alpha.dev.notification.cdssandbox.xyz",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "document.dev.alpha.notification.cdssandbox.xyz",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener_rule.alt-domain-host-route[0] will be updated in-place
  ~ resource "aws_lb_listener_rule" "alt-domain-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:800095993820:listener-rule/app/notification-dev-alb/77ce8d11a87750e4/4d7568f988d81a6f/af431775d87903f1"
        tags         = {}
        # (4 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "alpha.dev.notification.cdssandbox.xyz",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "dev.alpha.notification.cdssandbox.xyz",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-alt-root[0] must be replaced
-/+ resource "aws_route53_record" "notification-alt-root" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "alpha.dev.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_alpha.dev.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "alpha.dev.notification.cdssandbox.xyz" -> "dev.alpha.notification.cdssandbox.xyz" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-alt-root-WC[0] must be replaced
-/+ resource "aws_route53_record" "notification-alt-root-WC" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "*.alpha.dev.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_*.alpha.dev.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "*.alpha.dev.notification.cdssandbox.xyz" -> "*.dev.alpha.notification.cdssandbox.xyz" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.alpha.dev.notification.cdssandbox.xyz"] will be destroyed
  # (because key ["*.alpha.dev.notification.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_65a73dc17984586dde41232898b47f3a.lqynnrqbbf.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.alpha.dev.notification.cdssandbox.xyz"] will be destroyed
  # (because key ["*.api.alpha.dev.notification.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_afa21a0930387d68d48a907e30f24086.lqynnrqbbf.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.dev.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.dev.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.alpha.dev.notification.cdssandbox.xyz"] will be destroyed
  # (because key ["*.document.alpha.dev.notification.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_d99e64ef0d022bd4beab79bebaa902b3.document.alpha.dev.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__d99e64ef0d022bd4beab79bebaa902b3.document.alpha.dev.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_d99e64ef0d022bd4beab79bebaa902b3.document.alpha.dev.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_b5357770b7f067b622daa8b2a786caec.lqynnrqbbf.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.dev.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["alpha.dev.notification.cdssandbox.xyz"] will be destroyed
  # (because key ["alpha.dev.notification.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_f3ada9612ace5d5086ba482779686df3.alpha.dev.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_65a73dc17984586dde41232898b47f3a.lqynnrqbbf.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["api.alpha.dev.notification.cdssandbox.xyz"] will be destroyed
  # (because key ["api.alpha.dev.notification.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_a5c67dc844cc383b8ef4066ff7cbda36.api.alpha.dev.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_afa21a0930387d68d48a907e30f24086.lqynnrqbbf.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z04028033PLSHVOO9ZJ1Z" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["api.dev.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["dev.alpha.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:EKS_KARPENTER_AMI_ID-qn3fs3" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:EKS_KARPENTER_AMI_ID-qn3fs3|terraform-20240904133326131700000001" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240904133326131700000001" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id                          = "21536905-f7c8-4b09-9e3e-5cb466d153c0"
        name                        = "notification-canada-ca-waf"
        tags                        = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (9 unchanged attributes hidden)

      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
       ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_ec2_managed_prefix_list.google_cidrs"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.coredns"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.ebs_driver"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.kube_proxy"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_addon.vpc_cni"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_cluster.notification-canada-ca-eks-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_eks_node_group.notification-canada-ca-eks-node-group-k8s"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_instance_profile.karpenter"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
